{
  "auto_mapping": null,
  "base_model_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct",
  "inference_mode": true,
  "num_attention_heads": 14,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 50,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Classifique o seguinte texto jur\u00eddico na \u00e1rea do direito correspondente:",
  "revision": null,
  "task_type": "SEQ_CLS",
  "token_dim": 896,
  "tokenizer_kwargs": null,
  "tokenizer_name_or_path": "Qwen/Qwen2.5-0.5B-Instruct"
}